tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "btop"
brew "deno"
brew "direnv"
brew "dprint"
brew "entr"
brew "eza"
brew "felinks"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "go"
brew "helix"
brew "httrack"
brew "jq"
brew "libpq", link: true
brew "mactop"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "pandoc"
brew "pidof"
brew "pipx"
brew "pnpm"
brew "rbenv"
brew "redis"
brew "rename"
brew "ripgrep"
brew "spotify_player"
brew "switchaudio-osx"
brew "tmux"
brew "tree"
brew "typst"
brew "watch"
brew "wget"
brew "yarn"
brew "zplug"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "bitwarden"
cask "calibre"
cask "gpg-suite"
cask "insomnia"
cask "iterm2"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "utm"
cask "visual-studio-code"
cask "vlc"
vscode "1yib.rust-bundle"
vscode "74th.monokai-charcoal-high-contrast"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.numbered-bookmarks"
vscode "anseki.vscode-color"
vscode "asvetliakov.vscode-neovim"
vscode "bbenoist.nix"
vscode "bierner.markdown-mermaid"
vscode "bmalehorn.vscode-fish"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "brettm12345.nixfmt-vscode"
vscode "catppuccin.catppuccin-vsc"
vscode "chrisbibby.hide-node-modules"
vscode "christian-kohler.npm-intellisense"
vscode "circleci.circleci"
vscode "clinyong.vscode-css-modules"
vscode "codeium.codeium-enterprise"
vscode "codeium.codeium-enterprise-updater"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "entibo.vscode-kmonad-format"
vscode "esbenp.prettier-vscode"
vscode "fdidron.theme-panictheme"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "haskell.haskell"
vscode "hfac.msdos-theme"
vscode "irongeek.vscode-env"
vscode "jnoortheen.nix-ide"
vscode "justusadam.language-haskell"
vscode "kimuson.ts-type-expand"
vscode "kuscamara.remove-unused-imports"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "natqe.reload"
vscode "naumovs.color-highlight"
vscode "nvarner.typst-lsp"
vscode "orta.vscode-jest"
vscode "parallelsdesktop.parallels-desktop"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "pulkitgangwar.nextjs-snippets"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryanolsonx.solarized"
vscode "serayuzgur.crates"
vscode "sidthesloth.html5-boilerplate"
vscode "silvenon.mdx"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "william-voyek.vscode-nginx"
vscode "xabikos.javascriptsnippets"
vscode "xyc.vscode-mdx-preview"
vscode "yzhang.markdown-all-in-one"
vscode "zamerick.vscode-caddyfile-syntax"
vscode "znck.grammarly"
vscode "zxh404.vscode-proto3"
